spec/fixtures/campaign_management/add_ad_extensions/standard.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:ns0="https://bingads.microsoft.com/CampaignManagement/v12" xmlns:ns1="http://schemas.microsoft.com/2003/10/Serialization/Arrays" xmlns:ns2="http://schemas.datacontract.org/2004/07/System.Collections.Generic" xmlns:ns3="http://schemas.datacontract.org/2004/07/System" xmlns:ns4="https://adapi.microsoft.com" xmlns:ns5="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <ns0:AuthenticationToken>***FILTERED***</ns0:AuthenticationToken>
    <ns0:DeveloperToken>***FILTERED***</ns0:DeveloperToken>
    <ns0:CustomerId>***FILTERED***</ns0:CustomerId>
    <ns0:CustomerAccountId>***FILTERED***</ns0:CustomerAccountId>
  </soap:Header>
  <soap:Body>
    <ns0:AddAdExtensionsRequest>
      <ns0:AccountId>150168726</ns0:AccountId>
      <ns0:AdExtensions>
        <ns0:AdExtension xsi:type="ns0:CallAdExtension">
          <ns0:Scheduling/>
          <ns0:CountryCode>NZ</ns0:CountryCode>
          <ns0:PhoneNumber>0123456699</ns0:PhoneNumber>
        </ns0:AdExtension>
      </ns0:AdExtensions>
    </ns0:AddAdExtensionsRequest>
  </soap:Body>
</soap:Envelope>